src/test/resources/soap-payloads/P24-Thunes/P24RefundValidValues.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:schemas-cybersource-com:transaction-data-1.{{WSDLVersion}}">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>thunes_cert_so</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">juB3g2V3sXCKQ5GMb3ERbqUhbTvgVnugNRNPZcd7YadH3yqPuSUdYoi4BajvoEb/S3lSKV1hmtZoLukVWYav78LwSr1250Z7cHvyDZLOAmTERfJubbTu4bvzrHI4uIDnSjnVrvIO6CUZOuo5QrmTEL6+BZEocjrcz8lkw35FRTwT7UnEcCZQ0AdVMZON/AUl/RsYSkMHbEbutLFeBQGb883NDJrsdIuHBnW2uH3XRy42AxId1r5H2VVdjd0g1Cd8nEcAYQW+8JiYEVHHksHPErr41OO+2GOrXwGCXxsjJJ+55lLKtNZqQdkpUIx6nyl2F+4nDhC3QHh7hwbs0qVrWA==</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.191">
            <merchantID>thunes_cert_so</merchantID>
            <merchantReferenceCode>refnum1234</merchantReferenceCode>
            <purchaseTotals>
                <currency>PLN</currency>
                <grandTotalAmount>20.00</grandTotalAmount>
            </purchaseTotals>
            <apPaymentType>PTT</apPaymentType>
            <apRefundService run="true">
                <refundRequestID>12345678</refundRequestID>
            </apRefundService>
        </requestMessage>
    </soapenv:Body>
</soapenv:Envelope>